Revit 2026 API

# UIControlledApplicationIsViewerModeActive Property

---

Identifies if the current Revit session is running in Viewer mode

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsViewerModeActive { get; }
```
```vb
Public ReadOnly Property IsViewerModeActive As Boolean
	Get
```
```cpp
public:
property bool IsViewerModeActive {
	bool get ();
}
```
```fsharp
member IsViewerModeActive : bool with get
```

#### Property Value

Boolean

#### Reference

UIControlledApplication Class

Autodesk.Revit.UI Namespace